{
  "product": [
    {
      "id": 1,
      "title": "Samsung Galaxy S21",
      "image": "https://cdn1.smartprix.com/rx-ii3Pn8ry8-w1200-h1200/i3Pn8ry8.jpg",
      "price": 799.99,
      "description": "Experience the future with the Samsung Galaxy S21. This flagship smartphone features a stunning 6.2-inch Dynamic AMOLED display, a powerful Snapdragon 888 processor, and a versatile triple-camera system. With 5G connectivity and a sleek design, the Galaxy S21 is your gateway to a world of possibilities.",
      "subcategory": "Mobile",
      "quantity": 1,
      "brand": "Samsung",
      "category": "electronics"
    },
    {
      "id": 2,
      "title": "LG 55-Inch 4K OLED TV",
      "image": "https://5.imimg.com/data5/DI/ZS/CP/SELLER-50489472/fortex-hd-ready-ips-led-tv.jpg",
      "price": 1499.99,
      "description": "Elevate your home entertainment with the LG 55-Inch 4K OLED TV. Immerse yourself in stunning 4K visuals with vibrant colors and perfect blacks. This smart TV offers access to your favorite streaming services and comes with AI ThinQ technology for voice control. Enjoy cinematic experiences in the comfort of your living room.",
      "subcategory": "TV",
      "quantity": 1,
      "brand": "LG",
      "category": "electronics"
    },
    {
      "id": 3,
      "title": "Sony WH-1000XM4 Headphones",
      "image": "https://images.unsplash.com/photo-1505740420928-5e560c06d30e?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8aGVhZHBob25lc3xlbnwwfHwwfHx8MA%3D%3D&w=1000&q=80",
      "price": 349.99,
      "description": "Immerse yourself in music like never before with the Sony WH-1000XM4 headphones. These premium over-ear headphones offer industry-leading noise cancellation, stunning audio quality, and all-day comfort. With touch controls and long battery life, you can enjoy your favorite tunes in peace and style.",
      "subcategory": "Headphones",
      "quantity": 1,
      "brand": "Sony",
      "category": "electronics"
    },
    {
      "id": 4,
      "title": "Apple iPhone 13 Pro",
      "image": "https://androidmobile.pk/wp-content/uploads/2022/06/Phone-13-Pro-Max-128GB-Second-hand-Price-in-Pakistan-2022-676x800.png",
      "price": 1099.99,
      "description": "Unleash your creativity with the Apple iPhone 13 Pro. This cutting-edge smartphone features a ProMotion XDR display, the A15 Bionic chip, and a triple-camera system with ProRAW and ProRes video recording. With 5G capabilities and the iOS ecosystem, the iPhone 13 Pro is a powerhouse for professionals and enthusiasts.",
      "subcategory": "Mobile",
      "quantity": 1,
      "brand": "Apple",
      "category": "electronics"
    },
    {
      "id": 5,
      "title": "Samsung 65-Inch QLED 8K TV",
      "image": "https://www.sony.co.in/image/ccbe548efa94995a9c034d96a4a6acbb?fmt=pjpeg&bgcolor=FFFFFF&bgc=FFFFFF&wid=2515&hei=1320",
      "price": 2999.99,
      "description": "Experience TV like never before with the Samsung 65-Inch QLED 8K TV. This TV boasts an 8K Quantum Processor for breathtaking clarity and detail. Quantum HDR 32X and Object Tracking Sound+ create an immersive viewing experience. With AI-powered features and smart capabilities, it's a true masterpiece of technology.",
      "subcategory": "TV",
      "quantity": 1,
      "brand": "Samsung",
      "category": "electronics"
    },
    {
      "id": 6,
      "title": "Bose QuietComfort 45 Headphones",
      "image": "https://ptron.in/cdn/shop/products/B07XL8HFNC.MAIN.jpg?v=1667656208",
      "price": 299.99,
      "description": "Escape into pure serenity with the Bose QuietComfort 45 headphones. These over-ear headphones offer world-class noise cancellation, rich and balanced sound, and comfortable design for all-day listening. Whether you're traveling or at home, immerse yourself in your music, podcasts, and calls.",
      "subcategory": "Headphones",
      "quantity": 1,
      "brand": "Bose",
      "category": "electronics"
    },
    {
      "id": 7,
      "title": "Google Pixel 6 Pro",
      "image": "https://www.91-img.com/pictures/151039-v4-vivo-t2x-mobile-phone-large-1.jpg",
      "price": 899.99,
      "description": "Capture stunning moments and stay connected with the Google Pixel 6 Pro. This smartphone features a 6.71-inch OLED display, Google's custom Tensor chip, and a versatile camera system. With Android 12, 5G connectivity, and a sleek design, it's the ultimate tool for photography and productivity.",
      "subcategory": "Mobile",
      "quantity": 1,
      "brand": "Google",
      "category": "electronics"
    },
    {
      "id": 8,
      "title": "Sony 75-Inch 4K LED TV",
      "image": "https://www.myg.in/images/detailed/22/gconnect1.jpg",
      "price": 1799.99,
      "description": "Transform your home theater with the Sony 75-Inch 4K LED TV. This TV delivers stunning 4K visuals with vibrant colors and HDR support. It comes equipped with Android TV for streaming and Google Assistant for voice control. Dive into the world of entertainment with this impressive TV.",
      "subcategory": "TV",
      "quantity": 1,
      "brand": "Sony",
      "category": "electronics"
    },
    {
      "id": 9,
      "title": "Bose SoundSport Wireless Earbuds",
      "image": "https://m.media-amazon.com/images/I/61YTjEdKlzL.jpg",
      "price": 129.99,
      "description": "Fuel your workouts with the Bose SoundSport Wireless Earbuds. These earbuds offer exceptional sound quality, secure fit, and sweat resistance, making them ideal for active lifestyles. With Bluetooth connectivity and a lightweight design, they're your perfect workout companion.",
      "subcategory": "Headphones",
      "quantity": 1,
      "brand": "Bose",
      "category": "electronics"
    },
    {
      "id": 10,
      "title": "OnePlus 9T 5G",
      "image": "https://5.imimg.com/data5/SELLER/Default/2021/4/XM/RR/NM/122175801/oneplus9-1.jpg",
      "price": 699.99,
      "description": "Experience the speed of 5G with the OnePlus 9T. This smartphone features a 6.55-inch Fluid AMOLED display, a Snapdragon 870 chipset, and a versatile camera system co-developed with Hasselblad. With OxygenOS and a 120Hz refresh rate, it offers smooth performance and stunning visuals.",
      "subcategory": "Mobile",
      "quantity": 1,
      "brand": "OnePlus",
      "category": "electronics"
    },
    {
      "id": 11,
      "title": "Premium Comfort Sofa",
      "image": "https://shop.gkwretail.com/cdn/shop/products/Designer-Sofa-Set-in-Fabric-L-Shape_2.png?v=1651899140",
      "price": 699.99,
      "description": "Indulge in the epitome of relaxation with our Premium Comfort Sofa. This exceptionally plush and spacious sofa is designed to cradle you in absolute comfort. Its luxurious cushioning and ergonomic design make it the perfect addition to your living room. The rich upholstery not only exudes elegance but is also easy to clean, ensuring long-lasting beauty. Upgrade your lounging experience with this sofa that combines style, quality, and comfort.",
      "subcategory": "Sofa",
      "quantity": 1,
      "brand": "CozyHome",
      "category": "furnitures"
    },
    {
      "id": 12,
      "title": "Elegant Dream Bed",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQqvXsRVAiHAhgTj-mxRTzz9IxIwIW8W905dJKX6Wjp&s",
      "price": 899.99,
      "description": "Transform your bedroom into a sanctuary of elegance and comfort with our Elegant Dream Bed. Crafted with precision, this bed features a solid wood frame and a timeless design. The upholstered headboard adds a touch of luxury, while the sturdy construction ensures years of restful sleep. Create a dreamy atmosphere in your bedroom with this bed that combines style and durability. Sleep like royalty with the Elegant Dream Bed.",
      "subcategory": "Bed",
      "quantity": 1,
      "brand": "DreamSlumber",
      "category": "furnitures"
    },
    {
      "id": 13,
      "title": "Rustic Charm Cupboard",
      "image": "https://m.media-amazon.com/images/I/61-JpowHPtL.jpg",
      "price": 549.99,
      "description": "Add rustic charm and ample storage to your home with our Rustic Charm Cupboard. Crafted from reclaimed wood, this cupboard showcases the natural beauty of the material with a distressed finish. The spacious interior offers versatile storage options, making it perfect for your dining room, kitchen, or living space. Enhance your decor with this timeless piece that combines function and character.",
      "subcategory": "Cupboard",
      "quantity": 1,
      "brand": "WoodCrafters",
      "category": "furnitures"
    },
    {
      "id": 14,
      "title": "Contemporary Leather Sofa",
      "image": "https://www.at-home.co.in/cdn/shop/products/Somerville3str_45.jpg?v=1657281898",
      "price": 799.99,
      "description": "Experience contemporary luxury with our Contemporary Leather Sofa. This sleek and stylish sofa is upholstered in premium leather that not only looks sophisticated but also offers unmatched comfort. Its clean lines and tufted details add a modern touch to your living space. Crafted with precision and attention to detail, this sofa is the epitome of sophistication and comfort.",
      "subcategory": "Sofa",
      "quantity": 1,
      "brand": "ContempoLiving",
      "category": "furnitures"
    },
    {
      "id": 15,
      "title": "Luxury King Size Bed",
      "image": "https://www.at-home.co.in/cdn/shop/products/TimberlandkingLSWALNUT_23d4ee80-815e-4964-a8b2-06aa99e569f6.jpg?v=1659679856",
      "price": 1199.99,
      "description": "Indulge in ultimate luxury and comfort with our Luxury King Size Bed. This opulent bed is designed for those who appreciate the finer things in life. It features a grand upholstered headboard, intricate detailing, and a sturdy frame that ensures stability and durability. Elevate your bedroom decor and sleep like royalty with this exquisite king-size bed.",
      "subcategory": "Bed",
      "quantity": 1,
      "brand": "RoyalRest",
      "category": "furnitures"
    },
    {
      "id": 16,
      "title": "Vintage Oak Cupboard",
      "image": "https://hometown.gumlet.io/media/product/02/4453/19007/1.jpg?mode=fill&w=189&h=189&dpr=2.6",
      "price": 649.99,
      "description": "Bring vintage elegance into your home with our Vintage Oak Cupboard. Crafted from solid oak with a rich finish, this cupboard exudes timeless charm. Its ample storage space and adjustable shelves make it ideal for displaying your collectibles or storing dinnerware. Add a touch of nostalgia to your decor with this exquisite piece.",
      "subcategory": "Cupboard",
      "quantity": 1,
      "brand": "RetroHome",
      "category": "furnitures"
    },
    {
      "id": 17,
      "title": "Leather Recliner Sofa",
      "image": "https://www.at-home.co.in/cdn/shop/products/LAKEWOOD2strLS.jpg?v=1659677969",
      "price": 849.99,
      "description": "Experience ultimate relaxation with our Leather Recliner Sofa. This sofa combines the elegance of leather upholstery with the comfort of a recliner. Whether you're watching a movie or reading a book, this sofa offers adjustable comfort settings for your convenience. The modern design and premium materials make it a standout addition to your living room.",
      "subcategory": "Sofa",
      "quantity": 1,
      "brand": "LuxuryLiving",
      "category": "furnitures"
    },
    {
      "id": 18,
      "title": "Canopy Four-Poster Bed",
      "image": "https://images.woodenstreet.de/image/data/bed-with-storage-mdf/harper-bed-with-box-storage/exotic-teak/updated/n.jpg",
      "price": 999.99,
      "description": "Create a romantic oasis in your bedroom with our Canopy Four-Poster Bed. Crafted with attention to detail, this bed features elegant four-poster construction and sheer curtains, allowing you to create a private retreat. The solid wood frame ensures stability, while the timeless design adds a touch of sophistication to your decor.",
      "subcategory": "Bed",
      "quantity": 1,
      "brand": "DreamyNights",
      "category": "furnitures"
    },
    {
      "id": 19,
      "title": "Modern Glass Front Cupboard",
      "image": "https://ii1.pepperfry.com/media/catalog/product/u/j/494x544/ujisato-6-door-wardrobe-in-regato-walnut-finish-ujisato-6-door-wardrobe-in-regato-walnut-finish-r0hipu.jpg",
      "price": 599.99,
      "description": "Add a touch of modern sophistication to your space with our Modern Glass Front Cupboard. Its sleek design and glass front doors create an elegant display area for your favorite items. The interior shelves offer convenient storage for your belongings. Elevate your home decor with this stylish and functional cupboard.",
      "subcategory": "Cupboard",
      "quantity": 1,
      "brand": "ModernHome",
      "category": "furnitures"
    },
    {
      "description": "Add a touch of modern sophistication to your space with our Modern Glass Front Cupboard. ",
      "name": "armchair",
      "image": "https://img.freepik.com/premium-photo/brown-living-room-with-armchair-table-lamp-abstract-painting-art_258219-569.jpg?w=740",
      "quantity": 25,
      "price": 97,
      "brand": "brand 10",
      "subcategory": "sofa",
      "id": 20,
      "category": "furnitures"
    },
    {
      "id": 21,
      "title": "Men's Running Shoes",
      "image": "https://media.istockphoto.com/id/1303978937/photo/white-sneaker-on-a-blue-gradient-background-mens-fashion-sport-shoe-sneakers-lifestyle.jpg?s=612x612&w=0&k=20&c=L725fuzFTnm6qEaqE7Urc5q6IR80EgYQEjBn_qtBIQg=",
      "price": 79.99,
      "description": "Experience superior comfort and support with our Men's Running Shoes. These high-performance running shoes are designed for athletes and fitness enthusiasts. Featuring cushioned soles and breathable materials, they provide an optimal running experience. Whether you're hitting the track or the treadmill, these shoes will keep you going mile after mile.",
      "subcategory": "Shoes",
      "quantity": 1,
      "brand": "Active Run",
      "category": "footwear"
    },
    {
      "id": 22,
      "title": "Women's Fashion Sandals",
      "image": "https://images.pexels.com/photos/112285/pexels-photo-112285.jpeg?cs=srgb&dl=pexels-mike-bird-112285.jpg&fm=jpg",
      "price": 59.99,
      "description": "Elevate your style with our Women's Fashion Sandals. These elegant sandals are perfect for both casual and dressy occasions. With a stylish design and comfortable fit, they are the ideal choice for summer outings and parties. Step out in confidence and fashion with these stunning sandals.",
      "subcategory": "Sandals",
      "quantity": 1,
      "brand": "Chic Style",
      "category": "footwear"
    },
    {
      "id": 23,
      "title": "Men's Leather Loafers",
      "image": "https://images.pexels.com/photos/267301/pexels-photo-267301.jpeg?cs=srgb&dl=pexels-pixabay-267301.jpg&fm=jpg",
      "price": 89.99,
      "description": "Add a touch of sophistication to your footwear collection with our Men's Leather Loafers. Crafted from premium leather, these loafers exude timeless style and luxury. Whether you're dressing up for a formal event or looking for comfortable office footwear, these loafers offer both comfort and elegance.",
      "subcategory": "Shoes",
      "quantity": 1,
      "brand": "Elegant Step",
      "category": "footwear"
    },
    {
      "id": 24,
      "title": "Women's Comfortable Slippers",
      "image": "https://thumbs.dreamstime.com/b/slippers-violet-isolated-background-35167273.jpg",
      "price": 29.99,
      "description": "Relax in style with our Women's Comfortable Slippers. These cozy slippers are designed for ultimate comfort and warmth. With a soft and plush interior, they are perfect for lounging around the house or keeping your feet warm during chilly evenings. Pamper your feet with these luxurious slippers.",
      "subcategory": "Slippers",
      "quantity": 1,
      "brand": "Cozy Feet",
      "category": "footwear"
    },
    {
      "id": 25,
      "title": "Men's Hiking Boots",
      "image": "https://contents.mediadecathlon.com/p2393847/4d2cc2c91fbaeec4a0a3a00af395c64a/p2393847.jpg?format=auto&quality=70&f=650x0",
      "price": 119.99,
      "description": "Conquer the outdoors with our Men's Hiking Boots. These rugged and durable boots are designed for adventure seekers. With waterproof construction and superior traction, they are ideal for hiking, camping, and exploring the wilderness. Stay comfortable and protected on your outdoor journeys with these boots.",
      "subcategory": "Shoes",
      "quantity": 1,
      "brand": "Trailblazer",
      "category": "footwear"
    },
    {
      "id": 26,
      "title": "Women's Beach Sandals",
      "image": "https://m.media-amazon.com/images/I/61NdIc3396L._AC_UY1000_.jpg",
      "price": 39.99,
      "description": "Enjoy the sun and sand with our Women's Beach Sandals. These lightweight and waterproof sandals are perfect for a day at the beach or by the pool. With a non-slip sole and vibrant design options, they are both practical and stylish for your summer adventures.",
      "subcategory": "Sandals",
      "quantity": 1,
      "brand": "Beach Life",
      "category": "footwear"
    },
    {
      "id": 27,
      "title": "Men's Classic Oxfords",
      "image": "https://static.nike.com/a/images/t_PDP_1280_v1/f_auto,q_auto:eco,u_126ab356-44d8-4a06-89b4-fcdcc8df0245,c_scale,fl_relative,w_1.0,h_1.0,fl_layer_apply/28f581f1-975a-4df9-88b2-2ea2fb6d75f1/air-jordan-xxxvii-low-pf-basketball-shoes-7z7ltC.png",
      "price": 99.99,
      "description": "Step into timeless elegance with our Men's Classic Oxfords. These versatile shoes are perfect for formal occasions, business meetings, and upscale events. Crafted with attention to detail and premium materials, they exude sophistication and charm. Elevate your style with these classic oxfords.",
      "subcategory": "Shoes",
      "quantity": 1,
      "brand": "Classic Wear",
      "category": "footwear"
    },
    {
      "id": 28,
      "title": "Women's Furry Slippers",
      "image": "https://www.ikea.com/in/en/images/products/tasjoen-slippers-grey__0668751_pe714668_s5.jpg?f=s",
      "price": 34.99,
      "description": "Treat your feet to cozy luxury with our Women's Furry Slippers. These ultra-soft slippers feature a faux fur lining that pampers your feet with warmth and comfort. With a slip-on design and non-slip sole, they are perfect for lounging at home and unwinding in style.",
      "subcategory": "Slippers",
      "quantity": 1,
      "brand": "Snuggle Up",
      "category": "footwear"
    },
    {
      "id": 29,
      "title": "Men's Casual Sneakers",
      "image": "https://img.freepik.com/free-photo/ice-coffee-with-whipped-cream_144627-3801.jpg",
      "price": 69.99,
      "description": "Stay comfortable and stylish with our Men's Casual Sneakers. These versatile sneakers are perfect for everyday wear and casual outings. With a trendy design and cushioned insoles, they offer a blend of fashion and comfort. Upgrade your casual wardrobe with these sneakers.",
      "subcategory": "Shoes",
      "quantity": 1,
      "brand": "Urban Trend",
      "category": "footwear"
    },
    {
      "id": 30,
      "title": "Women's Boho Sandals",
      "image": "https://kxadmin.metroshoes.com/product/57-5023-21-25/1200/57-5023M21.jpg",
      "price": 49.99,
      "description": "Express your free-spirited style with our Women's Boho Sandals. These sandals feature unique bohemian-inspired designs that complement your adventurous personality. With comfortable straps and a cushioned footbed, they are perfect for exploring new places or adding flair to your daily look.",
      "subcategory": "Sandals",
      "quantity": 1,
      "brand": "Boho Vibe",
      "category": "footwear"
    }
  ],
  "userdata": [
    {
      "first_name": "Amol",
      "last_name": "Patil",
      "email": "amolkpatil22@gmail.com",
      "password": "123",
      "cart": [
        {
          "id": 14,
          "title": "Contemporary Leather Sofa",
          "image": "https://www.at-home.co.in/cdn/shop/products/Somerville3str_45.jpg?v=1657281898",
          "price": 799.99,
          "description": "Experience contemporary luxury with our Contemporary Leather Sofa. This sleek and stylish sofa is upholstered in premium leather that not only looks sophisticated but also offers unmatched comfort. Its clean lines and tufted details add a modern touch to your living space. Crafted with precision and attention to detail, this sofa is the epitome of sophistication and comfort.",
          "subcategory": "Sofa",
          "quantity": 2,
          "brand": "ContempoLiving",
          "category": "furnitures"
        },
        {
          "id": 1,
          "title": "Samsung Galaxy S21",
          "image": "https://cdn1.smartprix.com/rx-ii3Pn8ry8-w1200-h1200/i3Pn8ry8.jpg",
          "price": 415,
          "description": "Experience the future with the Samsung Galaxy S21. This flagship smartphone features a stunning 6.2-inch Dynamic AMOLED display, a powerful Snapdragon 888 processor, and a versatile triple-camera system. With 5G connectivity and a sleek design, the Galaxy S21 is your gateway to a world of possibilities.",
          "subcategory": "Mobile",
          "quantity": 1,
          "brand": "Samsung",
          "category": "electronics"
        },
        {
          "id": 6,
          "title": "Bose QuietComfort 45 Headphones",
          "image": "https://ptron.in/cdn/shop/products/B07XL8HFNC.MAIN.jpg?v=1667656208",
          "price": 179,
          "description": "Escape into pure serenity with the Bose QuietComfort 45 headphones. These over-ear headphones offer world-class noise cancellation, rich and balanced sound, and comfortable design for all-day listening. Whether you're traveling or at home, immerse yourself in your music, podcasts, and calls.",
          "subcategory": "Headphones",
          "quantity": 1,
          "brand": "Bose",
          "category": "electronics"
        },
        {
          "id": 2,
          "title": "LG 55-Inch 4K OLED TV",
          "image": "https://5.imimg.com/data5/DI/ZS/CP/SELLER-50489472/fortex-hd-ready-ips-led-tv.jpg",
          "price": 1499.99,
          "description": "Elevate your home entertainment with the LG 55-Inch 4K OLED TV. Immerse yourself in stunning 4K visuals with vibrant colors and perfect blacks. This smart TV offers access to your favorite streaming services and comes with AI ThinQ technology for voice control. Enjoy cinematic experiences in the comfort of your living room.",
          "subcategory": "TV",
          "quantity": 1,
          "brand": "LG",
          "category": "electronics"
        }
      ],
      "id": 5
    },
    {
      "first_name": "Raghuwansh",
      "last_name": "Singh",
      "email": "wansh786@gmai.com",
      "password": "1234",     
      "cart": [
        {
          "id": 2,
          "title": "LG 55-Inch 4K OLED TV",
          "image": "https://5.imimg.com/data5/DI/ZS/CP/SELLER-50489472/fortex-hd-ready-ips-led-tv.jpg",
          "price": 1499.99,
          "description": "Elevate your home entertainment with the LG 55-Inch 4K OLED TV. Immerse yourself in stunning 4K visuals with vibrant colors and perfect blacks. This smart TV offers access to your favorite streaming services and comes with AI ThinQ technology for voice control. Enjoy cinematic experiences in the comfort of your living room.",
          "subcategory": "TV",
          "quantity": 2,
          "brand": "LG",
          "category": "electronics"
        }
      ],
      "id": 6
    }
  ]
}